In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
connection_string = "postgresql+psycopg2://postgres:postgres@localhost:5433/dwh_airbnb"
engine = create_engine(connection_string)

In [3]:
schema_name = "stg"
table_name = "review"

query = f"SELECT * FROM {schema_name}.{table_name};"

df = pd.read_sql(query, engine)

df.head()

,listing_id,id,date,reviewer_id,comments
0,2095644,10198542,2014-02-05,11633294,"For my 1st time in Cape Town, I had an amazing..."
1,2112960,16867402,2014-08-03,9320640,"Waouh ! the house is just amazing, it is simpl..."
2,3341796,225640434,2018-01-07,9688002,Stunning place well located
3,3348208,340902301,2018-10-25,213073987,Le réel atout provient de la proximité d'un su...
4,3358000,24500367,2014-12-29,24802846,The Apartment was exactly the one I was lookin...

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1126953 entries, 0 to 1126952
Data columns (total 5 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   listing_id   1126953 non-null  int64
 1   id           1126953 non-null  int64
 2   date         1126953 non-null  object
 3   reviewer_id  1126953 non-null  int64
 4   comments     1126826 non-null  object
dtypes: int64(3), object(2)
memory usage: 43.0+ MB

In [5]:
len(df['listing_id'].unique())

1126953

El numero de listing_id unicos coincide con la cantidad de registros de la tabla, por tanto hay un solo review por listing. A su vez la cantidad de reviews es menor que la cantidad de listings, por tanto hay listings que nunca han sido reseñados en nuestro dataset.